## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: digitalocean
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # argocd_project.cinema will be created
+   resource "argocd_project" "cinema" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "environment" = "dev"
            }
+           name             = "cinema"
+           namespace        = "cinema"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       spec {
+           description  = "Cinema"
+           source_repos = [
+               "*",
            ]

+           cluster_resource_blacklist {
+               group = "*"
+               kind  = "*"
            }

+           cluster_resource_whitelist {
+               group = "rbac.authorization.k8s.io"
+               kind  = "ClusterRole"
            }
+           cluster_resource_whitelist {
+               group = "rbac.authorization.k8s.io"
+               kind  = "ClusterRoleBinding"
            }

+           destination {
+               namespace = "cinema"
+               server    = "https://kubernetes.default.svc"
            }

+           namespace_resource_blacklist {
+               group = "networking.k8s.io"
+               kind  = "Ingress"
            }

+           namespace_resource_whitelist {
+               group = "*"
+               kind  = "*"
            }

+           role {
+               name     = "cinema"
+               policies = [
+                   "p, proj:cinema:admin, applications, override, cinema/*, allow",
                ]
            }

+           sync_window {
+               applications = [
+                   "cinema",
                ]
+               clusters     = [
+                   "*",
                ]
+               duration     = "3600s"
+               kind         = "allow"
+               manual_sync  = true
+               namespaces   = [
+                   "*",
                ]
+               schedule     = "*/10 * * * *"
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:digitalocean workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| digitalocean | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
